7767517
29 29
Input                    input                    0 1 input
Convolution              /encoder1/enc1conv3/Conv 1 1 input /encoder1/enc1relu1/Relu_output_0 0=8 1=3 4=1 6=216 9=1
Convolution              /encoder2/enc2conv3/Conv 1 1 /encoder1/enc1relu1/Relu_output_0 /encoder2/enc2relu1/Relu_output_0 0=16 1=3 4=1 6=1152 9=1
Pooling                  /pool2/MaxPool           1 1 /encoder2/enc2relu1/Relu_output_0 /pool2/MaxPool_output_0 1=2 2=2 5=1
Convolution              /encoder3/enc3conv3/Conv 1 1 /pool2/MaxPool_output_0 /encoder3/enc3relu1/Relu_output_0 0=16 1=3 4=1 6=2304 9=1
Convolution              /encoder4/enc4conv3/Conv 1 1 /encoder3/enc3relu1/Relu_output_0 /encoder4/enc4relu1/Relu_output_0 0=32 1=3 4=1 6=4608 9=1
Convolution              /encoder5/enc5conv3/Conv 1 1 /encoder4/enc4relu1/Relu_output_0 /encoder5/enc5relu1/Relu_output_0 0=32 1=3 4=1 6=9216 9=1
Pooling                  /pool5/MaxPool           1 1 /encoder5/enc5relu1/Relu_output_0 /pool5/MaxPool_output_0 1=2 2=2 5=1
Convolution              /encoder6/enc6conv3/Conv 1 1 /pool5/MaxPool_output_0 /encoder6/enc6relu1/Relu_output_0 0=64 1=3 4=1 6=18432 9=1
Convolution              /encoder7/enc7conv3/Conv 1 1 /encoder6/enc6relu1/Relu_output_0 /encoder7/enc7relu1/Relu_output_0 0=64 1=3 4=1 6=36864 9=1
Pooling                  /pool7/MaxPool           1 1 /encoder7/enc7relu1/Relu_output_0 /pool7/MaxPool_output_0 1=2 2=2 5=1
Interp                   /decoder10/dec10up/Resize 1 1 /pool7/MaxPool_output_0 /decoder10/dec10up/Resize_output_0 0=2 1=2.000000e+00 2=2.000000e+00 6=1
Deconvolution            /decoder10/dec10Tconv2/ConvTranspose 1 1 /decoder10/dec10up/Resize_output_0 /decoder10/dec10norm2/BatchNormalization_output_0 0=64 1=3 4=1 5=1 6=36864
Deconvolution            /decoder9/dec9Tconv3/ConvTranspose 1 1 /decoder10/dec10norm2/BatchNormalization_output_0 /decoder9/dec9relu1/Relu_output_0 0=64 1=3 4=1 6=36864 9=1
BatchNorm                /decoder9/dec9norm2/BatchNormalization 1 1 /decoder9/dec9relu1/Relu_output_0 /decoder9/dec9norm2/BatchNormalization_output_0 0=64
Deconvolution            /decoder8/dec8Tconv3/ConvTranspose 1 1 /decoder9/dec9norm2/BatchNormalization_output_0 /decoder8/dec8relu1/Relu_output_0 0=64 1=3 4=1 6=36864 9=1
BatchNorm                /decoder8/dec8norm2/BatchNormalization 1 1 /decoder8/dec8relu1/Relu_output_0 /decoder8/dec8norm2/BatchNormalization_output_0 0=64
Interp                   /decoder7/dec7up/Resize  1 1 /decoder8/dec8norm2/BatchNormalization_output_0 /decoder7/dec7up/Resize_output_0 0=2 1=2.000000e+00 2=2.000000e+00 6=1
Deconvolution            /decoder7/dec7Tconv2/ConvTranspose 1 1 /decoder7/dec7up/Resize_output_0 /decoder7/dec7norm2/BatchNormalization_output_0 0=64 1=3 4=1 5=1 6=36864
Deconvolution            /decoder6/dec6Tconv3/ConvTranspose 1 1 /decoder7/dec7norm2/BatchNormalization_output_0 /decoder6/dec6relu1/Relu_output_0 0=32 1=3 4=1 6=18432 9=1
BatchNorm                /decoder6/dec6norm2/BatchNormalization 1 1 /decoder6/dec6relu1/Relu_output_0 /decoder6/dec6norm2/BatchNormalization_output_0 0=32
Deconvolution            /decoder5/dec5Tconv3/ConvTranspose 1 1 /decoder6/dec6norm2/BatchNormalization_output_0 /decoder5/dec5relu1/Relu_output_0 0=32 1=3 4=1 6=9216 9=1
BatchNorm                /decoder5/dec5norm2/BatchNormalization 1 1 /decoder5/dec5relu1/Relu_output_0 /decoder5/dec5norm2/BatchNormalization_output_0 0=32
Deconvolution            /decoder4/dec4Tconv3/ConvTranspose 1 1 /decoder5/dec5norm2/BatchNormalization_output_0 /decoder4/dec4relu1/Relu_output_0 0=16 1=3 4=1 6=4608 9=1
BatchNorm                /decoder4/dec4norm2/BatchNormalization 1 1 /decoder4/dec4relu1/Relu_output_0 /decoder4/dec4norm2/BatchNormalization_output_0 0=16
Interp                   /decoder3/dec3up/Resize  1 1 /decoder4/dec4norm2/BatchNormalization_output_0 /decoder3/dec3up/Resize_output_0 0=2 1=2.000000e+00 2=2.000000e+00 6=1
Deconvolution            /decoder3/dec3Tconv2/ConvTranspose 1 1 /decoder3/dec3up/Resize_output_0 /decoder3/dec3norm2/BatchNormalization_output_0 0=16 1=3 4=1 5=1 6=2304
Convolution              /decoder2/dec2conv3/Conv 1 1 /decoder3/dec3norm2/BatchNormalization_output_0 /decoder2/dec2relu1/Relu_output_0 0=8 1=3 4=1 6=1152 9=1
Convolution              /decoder1/Conv           1 1 /decoder2/dec2relu1/Relu_output_0 output 0=6 1=1 5=1 6=48
